Revit 2027 API
FailuresAccessor.ResolveFailure Method
 Resolves one failure using the failure resolution type last set for it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ResolveFailure(
	FailureMessageAccessor failure
)
Public Sub ResolveFailure (
	failure As FailureMessageAccessor
)
public:
void ResolveFailure(
	FailureMessageAccessor^ failure
)
member ResolveFailure :
        failure : FailureMessageAccessor -> unit
Parameters
failure FailureMessageAccessor
 The accessor to the failure to be resolved.
Exceptions
Exception | Condition
ArgumentException |  failure has not been properly initialized. -or- failure does not have any resolutions. -or- Default resolution of failure is not permitted or not applicable. -or- The failure was already attempted to resolve twice with that resolution type.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing). -or- Resolution of failures is not permitted in the current state of the document.
Remarks
 If failure resolution type was not set, the default failure resolution type will be used. After execution of the failure resolution the failure will not be removed from the document automatically. To prevent the failure from being delivered to the user, failures (pre)processor should return ProceedWithCommit. It will cause failures to be regenerated and failure resolution process to be restarted. If attempt to resolve failure was not successful, and the same failure is present on repetitive calls of the failures (pre)processor, the preprocessor code should take care to attempt a different resolution the next time the failure appears, to avoid an infinite loop.
See Also
Reference
FailuresAccessor Class
Autodesk.Revit.DB Namespace